posts/reading/service-design-patterns/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Service Design Patterns | Warren Liu</title>
<link href="../../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/poole.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/lanyon.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/custom.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://wudong.graceliu.uk/posts/reading/service-design-patterns/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../soa-patterns/" title="SOA Patterns" type="text/html">
<link rel="next" href="../redis-in-action/" title="Redis in Action" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Service Design Patterns">
<meta property="og:url" content="https://wudong.graceliu.uk/posts/reading/service-design-patterns/">
<meta property="og:description" content="Table of Contents


Web Service API Styles




Distributed objects typically maintained state between client
calls. This lead to a number of problems that hindered scalability.

Server memory utilizat">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="patterns">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://wudong.graceliu.uk/" title="Warren Liu" rel="home">Warren Liu</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Service Design Patterns</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Warren Liu</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Web Service API Styles</a></li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>Distributed objects typically maintained state between client
calls. This lead to a number of problems that hindered scalability.
<ul class="org-ul">
<li>Server memory utilization degraded with increased client load.
</li>
<li>Effective load-balancing techniques were more difficult to
implement and manage because session state was often reserved for
the client.
<ul class="org-ul">
<li>Unless a sophisticated infrastructure like shared memory cache
was used to access the client's session from any server.
</li>
</ul>
</li>
<li>Server had to implement a strategy to release the memory allocated
for a specific client instance.
<ul class="org-ul">
<li>In most cases the server relied on the client to notify it when
it was down.
</li>
<li>If the client crashed, it will be problematic.
</li>
</ul>
</li>
</ul>
</li>
<li>Possibly more important than the problem of latency is the fact that
web service calls typically entail distributed communications. This
means that client and service developers alike must be prepared to
handle partial failures.
</li>
<li>In light of these inherent risks, developers and architects should
<b>first</b> explore the alternatives.
<ul class="org-ul">
<li>A .NET client could host a JVM, load a Java library into the JVM,
and communicate with the target classes through JNI.
</li>
<li>Web services should therefore be reserved for situations in which
out-of-process and cross-machine calls "make sense".
</li>
</ul>
</li>
</ul>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Web Service API Styles</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>RPC API: How can client execute remote procedures over HTTP.
</li>
<li>Message API: How can clients send commands, notifications or other
information to remote systems over HTTP while avoiding direct
coupling to the remote procedures.
</li>
<li>Resource API: How can a client manipulate data managed by a remote
system, avoid direct coupling to remote procedures, and minimize the
need for <b>domain-specific</b> API.
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/patterns/" rel="tag">patterns</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../soa-patterns/" rel="prev" title="SOA Patterns">Previous post</a>
            </li>
            <li class="next">
                <a href="../redis-in-action/" rel="next" title="Redis in Action">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
